warbler12/FOC_Motor_Control/mcb/FOCAxialExample/mcb_pmsm_foc_I2C_f28379d_ert_rtw/mcb_pmsm_foc_I2C_f28379d.h
/*
 * Academic License - for use in teaching, academic research, and meeting
 * course requirements at degree granting institutions only.  Not for
 * government, commercial, or other organizational use.
 *
 * File: mcb_pmsm_foc_I2C_f28379d.h
 *
 * Code generated for Simulink model 'mcb_pmsm_foc_I2C_f28379d'.
 *
 * Model version                  : 7.9
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Thu Nov 27 18:33:18 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_mcb_pmsm_foc_I2C_f28379d_h_
#define RTW_HEADER_mcb_pmsm_foc_I2C_f28379d_h_
#ifndef mcb_pmsm_foc_I2C_f28379d_COMMON_INCLUDES_
#define mcb_pmsm_foc_I2C_f28379d_COMMON_INCLUDES_
#include <math.h>
#include <string.h>
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "MW_f2837xD_includes.h"
#include "string.h"
#include "can_message.h"
#include "F2837xD_device.h"
#include "DSP28xx_SciUtil.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif                           /* mcb_pmsm_foc_I2C_f28379d_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_pmsm_foc_I2C_f28379d_types.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <stddef.h>
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

extern void init_eCAN_B ( uint16_T bitRatePrescaler, uint16_T timeSeg1, uint16_T
  timeSeg2, uint16_T sbg, uint16_T sjw, uint16_T sam);
extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWMSyncSource(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);
extern void init_I2C_GPIO(void);
extern void init_I2C_A(void);
void CANB0_ClearFlag();
void CANB1_ClearFlag();

/* user code (top of export header file) */
#include "can_message.h"

/* Block signals for system '<S159>/If Action Subsystem' */
typedef struct {
  real32_T Convert_back;               /* '<S161>/Convert_back' */
  int16_T Convert_uint16;              /* '<S161>/Convert_uint16' */
} B_IfActionSubsystem_mcb_pmsm__T;

/* Block signals for system '<S159>/If Action Subsystem1' */
typedef struct {
  real32_T Convert_back;               /* '<S162>/Convert_back' */
  int16_T Convert_uint16;              /* '<S162>/Convert_uint16' */
} B_IfActionSubsystem1_mcb_pmsm_T;

/* Block signals for system '<S235>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S235>/SPI Master Transfer' */
} B_SPIMasterTransfer_mcb_pmsm__T;

/* Block states (default storage) for system '<S235>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SP_T obj; /* '<S235>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S235>/SPI Master Transfer' */
} DW_SPIMasterTransfer_mcb_pmsm_T;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Id_ref;                     /* '<S10>/Id_ref' */
  real32_T Sum;                        /* '<S246>/Sum' */
  real32_T Merge;                      /* '<S246>/Merge' */
  real32_T PProdOut;                   /* '<S345>/PProd Out' */
  real32_T Ki2;                        /* '<S246>/Ki2' */
  real32_T Integrator;                 /* '<S340>/Integrator' */
  real32_T Sum_h;                      /* '<S349>/Sum' */
  real32_T Switch;                     /* '<S247>/Switch' */
  real32_T Product;                    /* '<S302>/Product' */
  real32_T UnitDelay;                  /* '<S302>/Unit Delay' */
  real32_T Product1;                   /* '<S302>/Product1' */
  real32_T Add1;                       /* '<S302>/Add1' */
  real32_T Sum_i;                      /* '<S245>/Sum' */
  real32_T PProdOut_d;                 /* '<S288>/PProd Out' */
  real32_T Ki2_n;                      /* '<S245>/Ki2' */
  real32_T Integrator_a;               /* '<S283>/Integrator' */
  real32_T Sum_c;                      /* '<S292>/Sum' */
  real32_T DeadZone;                   /* '<S276>/DeadZone' */
  real32_T IProdOut;                   /* '<S280>/IProd Out' */
  real32_T Switch_d;                   /* '<S274>/Switch' */
  real32_T Saturation;                 /* '<S290>/Saturation' */
  real32_T DeadZone_c;                 /* '<S333>/DeadZone' */
  real32_T IProdOut_d;                 /* '<S337>/IProd Out' */
  real32_T Switch_c;                   /* '<S331>/Switch' */
  real32_T Saturation_n;               /* '<S347>/Saturation' */
  real32_T Sign;                       /* '<S246>/Sign' */
  real32_T Abs;                        /* '<S246>/Abs' */
  real32_T Sum1;                       /* '<S246>/Sum1' */
  real32_T Switch_n;                   /* '<S246>/Switch' */
  real32_T Product_m;                  /* '<S246>/Product' */
  int16_T Switch1;                     /* '<S274>/Switch1' */
  int16_T Switch2;                     /* '<S274>/Switch2' */
  int16_T Switch1_k;                   /* '<S331>/Switch1' */
  int16_T Switch2_o;                   /* '<S331>/Switch2' */
  boolean_T DataStoreRead1;            /* '<S245>/Data Store Read1' */
  boolean_T DataStoreRead1_k;          /* '<S247>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S245>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S274>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S274>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S274>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S274>/Equal1' */
  boolean_T AND3;                      /* '<S274>/AND3' */
  boolean_T RelationalOperator_e;      /* '<S331>/Relational Operator' */
  boolean_T fixforDTpropagationissue_f;
                                     /* '<S331>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_c;
                                    /* '<S331>/fix for DT propagation issue1' */
  boolean_T Equal1_m;                  /* '<S331>/Equal1' */
  boolean_T AND3_a;                    /* '<S331>/AND3' */
} B_SpeedControl_mcb_pmsm_foc_I_T;

