warbler12/FOC_Motor_Control/mcb/FOCAxialExample/mcb_pmsm_foc_I2C_f28379d_ert_rtw/mcb_pmsm_foc_I2C_f28379d.h
/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T Integrator_DSTATE;          /* '<S340>/Integrator' */
  real32_T UnitDelay_DSTATE;           /* '<S302>/Unit Delay' */
  real32_T Integrator_DSTATE_n;        /* '<S283>/Integrator' */
  int16_T Integrator_PrevResetState;   /* '<S340>/Integrator' */
  int16_T Integrator_PrevResetState_l; /* '<S283>/Integrator' */
} DW_SpeedControl_mcb_pmsm_foc__T;

/* Block signals (default storage) */
typedef struct {
  CAN_DATATYPE CANReceive_o2;          /* '<S2>/CAN Receive' */
  CAN_DATATYPE CANPack;                /* '<S20>/CAN Pack' */
  real_T RT12;                         /* '<Root>/RT12' */
  real_T Constant;                     /* '<Root>/Constant' */
  real_T CANUnpack_o1;                 /* '<S17>/CAN Unpack' */
  real_T CANUnpack_o2;                 /* '<S17>/CAN Unpack' */
  real_T Gain;                         /* '<S17>/Gain' */
  real_T Gain2;                        /* '<S17>/Gain2' */
  uint32_T PositionToCount;            /* '<S185>/PositionToCount' */
  uint32_T Delay;                      /* '<S185>/Delay' */
  uint32_T Sum[4];                     /* '<S166>/Sum' */
  uint32_T BytePack[2];                /* '<S210>/Byte Pack' */
  uint32_T SCI_Tx_Data[3];             /* '<S208>/Merge' */
  uint32_T SCI_Tx_Iteration;           /* '<S208>/Merge1' */
  uint32_T Sum_h[4];                   /* '<S156>/Sum' */
  uint32_T IndexVector;                /* '<S209>/Index Vector' */
  uint32_T Add;                        /* '<S209>/Add' */
  uint32_T Data[2];                    /* '<S212>/Data' */
  uint32_T Data_f[2];                  /* '<S213>/Data' */
  uint32_T Data_fw[2];                 /* '<S214>/Data' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT13;                       /* '<Root>/RT13' */
  real32_T RT3;                        /* '<Root>/RT3' */
  real32_T RT7;                        /* '<Root>/RT7' */
  real32_T CastToSingle1;              /* '<S12>/Cast To Single1' */
  real32_T Gain_f;                     /* '<S12>/Gain' */
  real32_T RT8;                        /* '<Root>/RT8' */
  real32_T RT9;                        /* '<Root>/RT9' */
  real32_T RT10[2];                    /* '<Root>/RT10' */
  real32_T RT11[2];                    /* '<Root>/RT11' */
  real32_T RT2[2];                     /* '<Root>/RT2' */
  real32_T RT4;                        /* '<Root>/RT4' */
  real32_T SCIReceive[2];              /* '<S244>/SCI Receive' */
  real32_T DataStoreRead2;             /* '<S4>/Data Store Read2' */
  real32_T Unwrap;                     /* '<S181>/Unwrap' */
  real32_T DTC;                        /* '<S201>/DTC' */
  real32_T SpeedGain;                  /* '<S185>/SpeedGain' */
  real32_T Product;                    /* '<S191>/Product' */
  real32_T UnitDelay;                  /* '<S191>/Unit Delay' */
  real32_T Product1;                   /* '<S191>/Product1' */
  real32_T Add1;                       /* '<S191>/Add1' */
  real32_T GetADCVoltage[2];           /* '<S203>/Get ADC Voltage' */
  real32_T GetCurrents[2];             /* '<S203>/Get Currents' */
  real32_T PU_Conversion[2];           /* '<S203>/PU_Conversion' */
  real32_T Switch;                     /* '<S193>/Switch' */
  real32_T Merge;                      /* '<S194>/Merge' */
  real32_T Numberofpolepairs;          /* '<S199>/Number of pole pairs' */
  real32_T Floor;                      /* '<S195>/Floor' */
  real32_T Add_c;                      /* '<S195>/Add' */
  real32_T Merge_o;                    /* '<S168>/Merge' */
  real32_T indexing;                   /* '<S166>/indexing' */
  real32_T Lookup[4];                  /* '<S166>/Lookup' */
  real32_T Sum3;                       /* '<S167>/Sum3' */
  real32_T DataTypeConversion1;        /* '<S166>/Data Type Conversion1' */
  real32_T Sum2;                       /* '<S166>/Sum2' */
  real32_T Product_i;                  /* '<S167>/Product' */
  real32_T Sum4;                       /* '<S167>/Sum4' */
  real32_T Sum5;                       /* '<S167>/Sum5' */
  real32_T Product1_b;                 /* '<S167>/Product1' */
  real32_T Sum6;                       /* '<S167>/Sum6' */
  real32_T DataStoreRead1;             /* '<S4>/Data Store Read1' */
  real32_T TmpSignalConversionAtSelectorIn[11];
  real32_T Selector[2];                /* '<S23>/Selector' */
  real32_T Sum_o;                      /* '<S39>/Sum' */
  real32_T PProdOut;                   /* '<S144>/PProd Out' */
  real32_T Kp1;                        /* '<S39>/Kp1' */
  real32_T Integrator;                 /* '<S139>/Integrator' */
  real32_T Sum_m;                      /* '<S148>/Sum' */
  real32_T Saturation;                 /* '<S146>/Saturation' */
  real32_T Sum_j;                      /* '<S38>/Sum' */
  real32_T PProdOut_g;                 /* '<S93>/PProd Out' */
  real32_T Ki1;                        /* '<S38>/Ki1' */
  real32_T Integrator_f;               /* '<S88>/Integrator' */
  real32_T Sum_g;                      /* '<S97>/Sum' */
  real32_T Saturation_f;               /* '<S95>/Saturation' */
  real32_T Switch_n;                   /* '<S42>/Switch' */
  real32_T Product_j;                  /* '<S42>/Product' */
  real32_T Product_f;                  /* '<S43>/Product' */
  real32_T Product1_g;                 /* '<S43>/Product1' */
  real32_T Sum1;                       /* '<S43>/Sum1' */
  real32_T Merge_i[2];                 /* '<S37>/Merge' */
  real32_T DeadZone;                   /* '<S81>/DeadZone' */
  real32_T IProdOut;                   /* '<S85>/IProd Out' */
  real32_T Switch_f;                   /* '<S79>/Switch' */
  real32_T DeadZone_a;                 /* '<S132>/DeadZone' */
  real32_T IProdOut_b;                 /* '<S136>/IProd Out' */
  real32_T Switch_a;                   /* '<S130>/Switch' */
  real32_T Merge_a;                    /* '<S159>/Merge' */
  real32_T indexing_d;                 /* '<S156>/indexing' */
  real32_T DataTypeConversion1_n;      /* '<S156>/Data Type Conversion1' */
  real32_T Lookup_p[4];                /* '<S156>/Lookup' */
  real32_T Sum3_j;                     /* '<S158>/Sum3' */
  real32_T Sum2_p;                     /* '<S156>/Sum2' */
  real32_T Product_d;                  /* '<S158>/Product' */
  real32_T Sum5_l;                     /* '<S158>/Sum5' */
  real32_T Product1_d;                 /* '<S158>/Product1' */
  real32_T Sum4_h;                     /* '<S158>/Sum4' */
  real32_T Sum6_h;                     /* '<S158>/Sum6' */
  real32_T Delay_c;                    /* '<S181>/Delay' */
  real32_T Sum_a;                      /* '<S181>/Sum' */
  real32_T Merge_c;                    /* '<S181>/Merge' */
  real32_T DataTypeConversion;         /* '<S27>/Data Type Conversion' */
  real32_T Switch_g;                   /* '<S204>/Switch' */
  real32_T OutportBufferForVdq_ref[2]; /* '<S4>/Control_System' */
  real32_T sqrt3_by_two;               /* '<S179>/sqrt3_by_two' */
  real32_T one_by_two;                 /* '<S179>/one_by_two' */
  real32_T add_c;                      /* '<S179>/add_c' */
  real32_T add_b;                      /* '<S179>/add_b' */
  real32_T Min;                        /* '<S176>/Min' */
  real32_T Max;                        /* '<S176>/Max' */
  real32_T Add_n;                      /* '<S176>/Add' */
  real32_T one_by_two_l;               /* '<S176>/one_by_two' */
  real32_T Add3;                       /* '<S175>/Add3' */
  real32_T Add2;                       /* '<S175>/Add2' */
  real32_T Add1_d;                     /* '<S175>/Add1' */
  real32_T Gain_a[3];                  /* '<S175>/Gain' */
  real32_T One_by_Two[3];              /* '<S27>/One_by_Two' */
  real32_T PWM_Duty_Cycles[3];         /* '<S27>/Sum' */
  real32_T acos_b;                     /* '<S165>/acos' */
  real32_T bsin;                       /* '<S165>/bsin' */
  real32_T sum_Ds;                     /* '<S165>/sum_Ds' */
  real32_T bcos;                       /* '<S165>/bcos' */
  real32_T asin_o;                     /* '<S165>/asin' */
  real32_T sum_Qs;                     /* '<S165>/sum_Qs' */
  real32_T Switch_h[2];                /* '<S172>/Switch' */
  real32_T algDD_o1;
  real32_T algDD_o2;
  real32_T qcos;                       /* '<S157>/qcos' */
  real32_T dsin;                       /* '<S157>/dsin' */
  real32_T sum_beta;                   /* '<S157>/sum_beta' */
  real32_T dcos;                       /* '<S157>/dcos' */
  real32_T qsin;                       /* '<S157>/qsin' */
  real32_T sum_alpha;                  /* '<S157>/sum_alpha' */
  real32_T Switch_b[2];                /* '<S163>/Switch' */
  real32_T algDD_o1_p;
  real32_T algDD_o2_o;
  real32_T Product_o[2];               /* '<S44>/Product' */
  real32_T SquareRoot;                 /* '<S44>/Square Root' */
  real32_T Switch_as;                  /* '<S44>/Switch' */
  real32_T Reciprocal;                 /* '<S44>/Reciprocal' */
  real32_T Switch_j[2];                /* '<S41>/Switch' */
  real32_T Switch2;                    /* '<S51>/Switch2' */
  real32_T Product_b;                  /* '<S50>/Product' */
  real32_T Sum_jr;                     /* '<S50>/Sum' */
  real32_T Product2;                   /* '<S50>/Product2' */
  real32_T Merge_d;                    /* '<S50>/Merge' */
  real32_T Gain_b;                     /* '<S50>/Gain' */
  real32_T Switch_m;                   /* '<S51>/Switch' */
  real32_T Switch1;                    /* '<S52>/Switch1' */
  real32_T Sqrt;                       /* '<S52>/Sqrt' */
  real32_T Gain_l;                     /* '<S52>/Gain' */
  real32_T a_plus_2b;                  /* '<S36>/a_plus_2b' */
  real32_T one_by_sqrt3;               /* '<S36>/one_by_sqrt3' */
  real32_T algDD_o1_e;
  real32_T algDD_o2_h;
  real32_T Gain_p;                     /* '<S21>/Gain' */
  real32_T Gain_po;                    /* '<S3>/Gain' */
  real32_T Gain1;                      /* '<S3>/Gain1' */
  real32_T Gain2_b;                    /* '<S3>/Gain2' */
  real32_T Gain3;                      /* '<S3>/Gain3' */
  real32_T Gain2_g;                    /* '<S21>/Gain2' */
  real32_T T;                          /* '<S21>/T' */
  real32_T Loss;                       /* '<S21>/Loss' */
  real32_T Gain3_m;                    /* '<S21>/Gain3' */
  real32_T Bias1;                      /* '<S21>/Bias1' */
  real32_T Gain1_f;                    /* '<S21>/Gain1' */
  real32_T Bias;                       /* '<S21>/Bias' */
  real32_T CastToSingle;               /* '<S17>/Cast To Single' */
  real32_T CastToSingle1_m;            /* '<S17>/Cast To Single1' */
  real32_T UnitDelay_l;                /* '<S18>/Unit Delay' */
  real32_T UnitDelay1;                 /* '<S18>/Unit Delay1' */
  int32_T SpeedCount;                  /* '<S185>/SpeedCount' */
  int32_T DataTypeConversion_c[2];     /* '<S182>/Data Type Conversion' */
  int32_T Add_e[2];                    /* '<S182>/Add' */
  uint16_T Switch_c;                   /* '<S227>/Switch' */
  uint16_T Divide;                     /* '<S226>/Divide' */
  uint16_T Divide1;                    /* '<S226>/Divide1' */
  uint16_T ForIterator;                /* '<S229>/For Iterator' */
  uint16_T ADC_A_IN0;                  /* '<S229>/ADC_A_IN0' */
  uint16_T ADC_B_IN0;                  /* '<S229>/ADC_B_IN0' */
  uint16_T Memory;                     /* '<S234>/Memory' */
  uint16_T Sum_hk;                     /* '<S234>/Sum' */
  uint16_T Memory1;                    /* '<S234>/Memory1' */
  uint16_T Sum1_j;                     /* '<S234>/Sum1' */
  uint16_T DataTypeConversion2;        /* '<S242>/Data Type Conversion2' */
  uint16_T BitwiseOperator;            /* '<S241>/Bitwise Operator' */
  uint16_T BitwiseOperator1;           /* '<S241>/Bitwise Operator1' */
  uint16_T ShiftArithmetic1;           /* '<S241>/Shift Arithmetic1' */
  uint16_T BitwiseOperator2;           /* '<S241>/Bitwise Operator2' */
  uint16_T ShiftArithmetic2;           /* '<S241>/Shift Arithmetic2' */
  uint16_T Output;                     /* '<S211>/Output' */
  uint16_T DataStoreRead1_o;           /* '<S182>/Data Store Read1' */
  uint16_T DataStoreRead2_j;           /* '<S182>/Data Store Read2' */
  uint16_T ADC_C_IN2;                  /* '<S180>/ADC_C_IN2' */
  uint16_T ADC_B_IN2;                  /* '<S180>/ADC_B_IN2' */
  uint16_T DataTypeConversion_i;       /* '<S168>/Data Type Conversion' */
  uint16_T Get_Integer;                /* '<S166>/Get_Integer' */
  uint16_T DataStoreRead;              /* '<S23>/Data Store Read' */
  uint16_T MultiportSwitch[2];         /* '<S23>/Multiport Switch' */
  uint16_T FixPtSum1;                  /* '<S215>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S216>/FixPt Switch' */
  uint16_T Switch1_j;                  /* '<S42>/Switch1' */
  uint16_T DataTypeConversion_h;       /* '<S159>/Data Type Conversion' */
  uint16_T Get_Integer_j;              /* '<S156>/Get_Integer' */
  uint16_T Switch1_jv[3];              /* '<S204>/Switch1' */
  uint16_T Scale_to_PWM_Counter_PRD[3];/* '<S204>/Scale_to_PWM_Counter_PRD' */
  uint16_T DataTypeConversion_f;       /* '<S40>/Data Type Conversion' */
  uint16_T DataTypeConversion_fl;      /* '<S50>/Data Type Conversion' */
  uint16_T DataTypeConversion1_l;      /* '<S20>/Data Type Conversion1' */
  uint16_T DataTypeConversion2_m;      /* '<S21>/Data Type Conversion2' */
  uint16_T DataTypeConversion4;        /* '<S21>/Data Type Conversion4' */
  uint16_T DataTypeConversion3;        /* '<S21>/Data Type Conversion3' */
  uint16_T I2CTransmit1;               /* '<S15>/I2C Transmit1' */
  uint16_T raw_angle;                  /* '<S12>/MATLAB Function' */
  uint16_T I2CReceive_o2;              /* '<S11>/I2C Receive' */
  uint16_T I2CTransmit;                /* '<S11>/I2C Transmit' */
  int16_T WhileIterator;               /* '<S209>/While Iterator' */
  uint16_T I2CReceive_o1[2];           /* '<S11>/I2C Receive' */
  int16_T Switch1_h;                   /* '<S79>/Switch1' */
  int16_T Switch2_l;                   /* '<S79>/Switch2' */
  int16_T Switch1_l;                   /* '<S130>/Switch1' */
  int16_T Switch2_c;                   /* '<S130>/Switch2' */
  boolean_T DataStoreRead_g;           /* '<S1>/Data Store Read' */
  boolean_T RT4_h;                     /* '<S1>/RT4' */
  boolean_T UnitDelay_l4;              /* '<S1>/Unit Delay' */
  boolean_T LogicalOperator2;          /* '<S1>/Logical Operator2' */
  boolean_T NOT;                       /* '<S225>/NOT' */
  boolean_T DataTypeConversion3_f;     /* '<S241>/Data Type Conversion3' */
  boolean_T Compare;                   /* '<S169>/Compare' */
  boolean_T DataStoreRead1_b;          /* '<S39>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S39>/Logical Operator' */
  boolean_T DataStoreRead1_m;          /* '<S38>/Data Store Read1' */
  boolean_T LogicalOperator_a;         /* '<S38>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S79>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S79>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S79>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S79>/Equal1' */
  boolean_T AND3;                      /* '<S79>/AND3' */
  boolean_T RelationalOperator_e;      /* '<S130>/Relational Operator' */
  boolean_T fixforDTpropagationissue_j;
                                     /* '<S130>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1_o;
                                    /* '<S130>/fix for DT propagation issue1' */
  boolean_T Equal1_i;                  /* '<S130>/Equal1' */
  boolean_T AND3_n;                    /* '<S130>/AND3' */
  boolean_T Compare_f;                 /* '<S160>/Compare' */
  boolean_T PWM_En;                    /* '<S27>/Enable' */
  boolean_T RelationalOperator_k;      /* '<S40>/Relational Operator' */
  boolean_T Compare_k;                 /* '<S46>/Compare' */
  boolean_T Compare_f0;                /* '<S47>/Compare' */
  boolean_T LowerRelop1;               /* '<S51>/LowerRelop1' */
  boolean_T RelationalOperator_l;      /* '<S50>/Relational Operator' */
  boolean_T UpperRelop;                /* '<S51>/UpperRelop' */
  boolean_T DataStoreRead1_a;          /* '<S20>/Data Store Read1' */
  boolean_T RelationalOperator_b;      /* '<S18>/Relational Operator' */
  boolean_T RelationalOperator1;       /* '<S18>/Relational Operator1' */
  boolean_T LogicalOperator_g;         /* '<S18>/Logical Operator' */
  B_SpeedControl_mcb_pmsm_foc_I_T SpeedControl;/* '<Root>/Speed Control' */
  B_SPIMasterTransfer_mcb_pmsm__T SPIMasterTransfer1;/* '<S235>/SPI Master Transfer' */
  B_SPIMasterTransfer_mcb_pmsm__T SPIMasterTransfer;/* '<S235>/SPI Master Transfer' */
  B_IfActionSubsystem1_mcb_pmsm_T IfActionSubsystem1_k;/* '<S168>/If Action Subsystem1' */
  B_IfActionSubsystem_mcb_pmsm__T IfActionSubsystem_e;/* '<S168>/If Action Subsystem' */
  B_IfActionSubsystem1_mcb_pmsm_T IfActionSubsystem1;/* '<S159>/If Action Subsystem1' */
  B_IfActionSubsystem_mcb_pmsm__T IfActionSubsystem;/* '<S159>/If Action Subsystem' */
} B_mcb_pmsm_foc_I2C_f28379d_T;

