warbler12/FOC_Motor_Control/mcb/FOCAxialExample/mcb_pmsm_foc_I2C_f28379d_ert_rtw/mcb_pmsm_foc_I2C_f28379d.h
/* Real-time Model object */
extern RT_MODEL_mcb_pmsm_foc_I2C_f28_T *const mcb_pmsm_foc_I2C_f28379d_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCB1_INT(void);
  interrupt void SCIA_RX_INT(void);
  void mcb_pmsm_foc_I2C_f28379d_configure_interrupts (void);
  void mcb_pmsm_foc_I2C_f28379d_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'mcb_pmsm_foc_I2C_f28379d'
 * '<S1>'   : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read'
 * '<S2>'   : 'mcb_pmsm_foc_I2C_f28379d/CAN Receive'
 * '<S3>'   : 'mcb_pmsm_foc_I2C_f28379d/CAN_Transmit'
 * '<S4>'   : 'mcb_pmsm_foc_I2C_f28379d/Current Control'
 * '<S5>'   : 'mcb_pmsm_foc_I2C_f28379d/HW Interrupt'
 * '<S6>'   : 'mcb_pmsm_foc_I2C_f28379d/Hardware Init'
 * '<S7>'   : 'mcb_pmsm_foc_I2C_f28379d/Heartbeat LED'
 * '<S8>'   : 'mcb_pmsm_foc_I2C_f28379d/Inverter and Motor - Plant Model'
 * '<S9>'   : 'mcb_pmsm_foc_I2C_f28379d/Serial Receive'
 * '<S10>'  : 'mcb_pmsm_foc_I2C_f28379d/Speed Control'
 * '<S11>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Data Read'
 * '<S12>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Data Realignment '
 * '<S13>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Initialization'
 * '<S14>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Data Realignment /MATLAB Function'
 * '<S15>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Initialization/Address - Data read'
 * '<S16>'  : 'mcb_pmsm_foc_I2C_f28379d/AS5600 Read/Initialization/Delay 1ms'
 * '<S17>'  : 'mcb_pmsm_foc_I2C_f28379d/CAN Receive/Subsystem2'
 * '<S18>'  : 'mcb_pmsm_foc_I2C_f28379d/CAN Receive/Subsystem2/Change_detect'
 * '<S19>'  : 'mcb_pmsm_foc_I2C_f28379d/CAN Receive/Subsystem2/Subsystem'
 * '<S20>'  : 'mcb_pmsm_foc_I2C_f28379d/CAN_Transmit/CAN_Tx'
 * '<S21>'  : 'mcb_pmsm_foc_I2C_f28379d/CAN_Transmit/DataLog'
 * '<S22>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System'
 * '<S23>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Debug_signals'
 * '<S24>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/HW_Inputs'
 * '<S25>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Input Scaling'
 * '<S26>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Inverter'
 * '<S27>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Output Scaling'
 * '<S28>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Pos_selection'
 * '<S29>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/SCI_Tx'
 * '<S30>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Clarke Transform'
 * '<S31>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers'
 * '<S32>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Inverse Park Transform'
 * '<S33>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Park Transform'
 * '<S34>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Space Vector Generator'
 * '<S35>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Clarke Transform/Two phase input'
 * '<S36>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Clarke Transform/Two phase input/Two phase CRL wrap'
 * '<S37>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter'
 * '<S38>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id'
 * '<S39>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq'
 * '<S40>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D-Q Equivalence'
 * '<S41>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority'
 * '<S42>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/Inport//Dialog Selection'
 * '<S43>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/Magnitude_calc'
 * '<S44>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D-Q Equivalence/Limiter'
 * '<S45>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D-Q Equivalence/Passthrough'
 * '<S46>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant'
 * '<S47>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/Compare To Constant1'
 * '<S48>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs'
 * '<S49>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/flipInputs1'
 * '<S50>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter'
 * '<S51>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef1'
 * '<S52>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/limitRef2'
 * '<S53>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/DQ Limiter/D//Q Axis Priority/limiter/passThrough'
 * '<S54>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset'
 * '<S55>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S56>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S57>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S58>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S59>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S60>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S61>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S62>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S63>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S64>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S65>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S66>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S67>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S68>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S69>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S70>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S71>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S72>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S73>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S74>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S75>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S76>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S77>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S78>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S79>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S80>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S81>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S82>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S83>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S84>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S85>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S86>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S87>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S88>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S89>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S90>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S91>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S92>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S93>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S94>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S95>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S96>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S97>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S98>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S99>'  : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S100>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S101>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S102>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S103>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S104>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Id/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S105>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset'
 * '<S106>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S107>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S108>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S109>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S110>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S111>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S112>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S113>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S114>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S115>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S116>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S117>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S118>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S119>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S120>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S121>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S122>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S123>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S124>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S125>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S126>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S127>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S128>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S129>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S130>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S131>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S132>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S133>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S134>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S135>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S136>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S137>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S138>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S139>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S140>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S141>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S142>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S143>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S144>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S145>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S146>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S147>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S148>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S149>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S150>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S151>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S152>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S153>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S154>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S155>' : 'mcb_pmsm_foc_I2C_f28379d/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
