warbler12/FOC_Motor_Control/mcb/FOCAxialExample/mcb_pmsm_foc_I2C_f28379d_ert_rtw/mcb_pmsm_foc_I2C_f28379d.h
 * '<S347>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S348>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S349>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S350>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S351>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S352>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S353>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S354>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S355>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S356>' : 'mcb_pmsm_foc_I2C_f28379d/Speed Control/POS_Loop/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 */
#endif                              /* RTW_HEADER_mcb_pmsm_foc_I2C_f28379d_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
